app/controllers/quotes_controller.rb

    def index
      @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"

    def create
      @quote = Quote.new(quote_params)

      if @quote.save
---
INSERT INTO "quotes" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "aaaa"], ["created_at", "2022-06-21 18:04:05.757334"], ["updated_at", "2022-06-21 18:04:05.757334"]]

    def update
      if @quote.update(quote_params)
---
UPDATE "quotes" SET "name" = ?, "updated_at" = ? WHERE "quotes"."id" = ?  [["name", "aaaacc"], ["updated_at", "2022-06-21 18:04:17.977046"], ["id", 1]]

    def destroy
      @quote.destroy
---
DELETE FROM "quotes" WHERE "quotes"."id" = ?  [["id", 1]]